[
  {
    "id": 1,
    "projectName": "JobHive - A Hiring Agency & Communication Platform",
    "description": "JobHive is a dynamic hiring platform that connects job seekers, employers, freelancers, and recruiters. It offers job posting, profile management, real-time messaging, interview scheduling, and secure transactions for faster and more efficient remote hiring.",
    "category": "Full Stack Web Development",
    "team": "Solo Project",
    "coreFeatures": [
      "Job posting and advanced job search with filters (category, location, salary, etc.)",
      "Detailed profile and resume management with video introductions",
      "Application tracking, interview scheduling, and offer letter management",
      "Real-time chat system using Socket.IO for direct employer-candidate communication",
      "Integrated ZegoCloud-powered video meetings for one-on-one or panel interviews",
      "Instant notifications for interviews, job offers, and system messages",
      "Role-based dashboards for admin, employers, and job seekers",
      "AI-powered Gemini bot to guide users and enhance interactivity",
      "Forum and blog sections for community interaction and job-seeking advice",
      "Free course page with resume tips, interview skills, and presentation guides",
      "Password reset with secure email integration via NodeMailer"
    ],
    "techStack": [
      "React.js",
      "Tailwind CSS",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Socket.IO",
      "ZegoCloud",
      "Firebase",
      "JWT",
      "Gemini AI",
      "NodeMailer"
    ],
    "codeLink": "https://github.com/alaminislam34/Hiring-Agency-Communication-Platform",
    "liveDemo": "https://jobhive-agency.vercel.app/",
    "image": "/jobhive.png",
    "challenges": ["Implementing real-time chat with Socket.IO and integrating video meetings via ZegoCloud were tricky. Managing state across roles required careful planning."],
    "futurePlans": ["Add AI-driven resume analysis and expand messaging features with group chats and file sharing."]
  },
  {
    "id": 2,
    "projectName": "EduConnect - An Education Management Platform",
    "description": "EduManage is a MERN stack education management platform for institutions, tutors, and students. It provides role-based dashboards, class management, and AI-powered support for seamless learning experiences.",
    "category": "A Mern Stack Web Development",
    "team": "Solo Project",
    "coreFeatures": [
      "User authentication and role-based dashboards (admin, tutor, student)",
      "Secure private and protected routes with JWT & Firebase Auth",
      "Create, update, and manage classes and assignments",
      "Student enrollment, assignment submission, and progress tracking",
      "Real-time data updates with TanStack Query",
      "Notifications and alerts with SweetAlert2",
      "AI assistant chatbot (Gemini) for interactive help",
      "Admin features to approve/reject classes and manage users",
      "Responsive design for all device sizes",
      "Optional dark/light mode and performance analytics"
    ],
    "techStack": [
      "React.js",
      "Tailwind CSS",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Firebase",
      "JWT",
      "TanStack Query",
      "Gemini AI",
      "SweetAlert2"
    ],
    "codeLink": "https://github.com/imroknujjamanrony/edu-connect-client",
    "liveDemo": "https://educonnect-5a40e.web.app/",
    "image": "/EduConnect.png",
    "challenges": ["Managing real-time data sync with TanStack Query and implementing secure role-based access took extra effort."],
    "futurePlans": ["Add video conferencing for live classes and expand AI chatbot with voice recognition."]
  },
  {
    "id": 3,
    "projectName": "MarathonHub - A Marathon Management System",
    "description": "Marathon Hub, your one-stop platform for exploring and registering for upcoming marathons. Whether you're a seasoned runner or just starting your journey, Marathon Hub helps you discover marathons tailored to your interests and capabilities.",
    "category": "Full Stack Web Development",
    "team": "Solo Project",
    "coreFeatures": [
      "Comprehensive marathon listings with details like location, date, distance, and registration info",
      "Responsive design optimized for all devices using Tailwind CSS",
      "Dynamic data integration using a JSON file and backend query support",
      "Search functionality to filter marathons by keyword, location, or date",
      "Interactive UI with modern card layouts and hover effects",
      "Event detail previews including organizers and short descriptions",
      "AI-powered bot integration to guide users and answer marathon-related queries",
      "MongoDB backend for efficient data storage and retrieval",
      "Admin and user-friendly interface for exploring events"
    ],
    "techStack": [
      "React.js",
      "Tailwind CSS",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Firebase",
      "Gemini AI"
    ],
    "codeLink": "https://github.com/imroknujjamanrony/Marathon-Hub",
    "liveDemo": "https://marathon-hub-12397.web.app/",
    "image": "/marathon-hub.png",
    "challenges": ["Building an efficient search and filtering system while keeping UI smooth was challenging."],
    "futurePlans": ["Add marathon registration and payment features plus personalized recommendations."]
  }
]
